const MORSE_TABLE = {
    '.-': 'a',
    '-...': 'b',
    '-.-.': 'c',
    '-..': 'd',
    '.': 'e',
    '..-.': 'f',
    '--.': 'g',
    '....': 'h',
    '..': 'i',
    '.---': 'j',
    '-.-': 'k',
    '.-..': 'l',
    '--': 'm',
    '-.': 'n',
    '---': 'o',
    '.--.': 'p',
    '--.-': 'q',
    '.-.': 'r',
    '...': 's',
    '-': 't',
    '..-': 'u',
    '...-': 'v',
    '.--': 'w',
    '-..-': 'x',
    '-.--': 'y',
    '--..': 'z',
    '.----': '1',
    '..---': '2',
    '...--': '3',
    '....-': '4',
    '.....': '5',
    '-....': '6',
    '--...': '7',
    '---..': '8',
    '----.': '9',
    '-----': '0',
};

function decode(expr) {
    // присваиваем пустую строку в качестве начального значения.
    let decodedString = '';

    // Разбиваем строку на группы по 10 символов
    for (let i = 0; i < expr.length; i += 10) {
        const morseCode = expr.slice(i, i + 10);

        // Если встречается пустое место, добавляем пробел в декодированную строку
        if (morseCode === '**********') {
            decodedString += ' ';
        } else {
            let morseString = '';

            // Разбиваем закодированный символ на пары двоичных цифр
            for (let j = 0; j < morseCode.length; j += 2) {
                const morseSymbol = morseCode.slice(j, j + 2);

                // Преобразуем пару двоичных цифр в символ азбуки Морзе
                if (morseSymbol === '10') {
                    morseString += '.';
                } else if (morseSymbol === '11') {
                    morseString += '-';
                }
            }

            // Декодируем символ азбуки Морзе в букву и добавляем в декодированную строку
            decodedString += MORSE_TABLE[morseString];
        }
    }

    return decodedString;
}

module.exports = {
    decode
}

